{
  "preguntas": [
    {
      "pregunta": "hola",
      "respuesta": [
        "que tal",
        "Hola, como estas?"
      ]
    },
    {
      "pregunta": "como estas?",
      "respuesta": [
        "bien, muchas gracias"
      ]
    },
    {
      "pregunta": "que estas haciendo",
      "respuesta": [
        "buscando respuestas para sus preguntas"
      ]
    },
    {
      "pregunta": "que haces",
      "respuesta": "estoy prosesando información para usted"
    },
    {
      "pregunta": "quienes te crearon",
      "respuesta": [
        "mis programadores osn unos talentosos estudiantes de Modelos discretos"
      ]
    },
    {
      "pregunta": "que hubo",
      "respuesta": [
        "hola, como te encuentras hoy"
      ]
    },
    {
      "pregunta": "bien",
      "respuesta": [
        "me alegro mucho"
      ]
    },
    {
      "pregunta": "cual es tu nombre",
      "respuesta": [
        "soy un chatbot "
      ]
    },
    {
      "pregunta": "que es un auto",
      "respuesta": [
        "un automóvil o coche, es un vehículo mecánico de propulsión propia destinado al transporte de personas, generalmente con cuatro ruedas y capacidad entre una y nueve plazas. Las ruedas \"delanteras\" pueden moverse hacia los lados para permitir giros y tomar las curvas."
      ]
    },
    {
      "pregunta": "que piensas del calentamiento global",
      "respuesta": [
        "vamos a morir pipipi"
      ]
    },
    {
      "pregunta": "Que es conjuncion?",
      "respuesta": [
        "La conjunción es un operador, que actúa sobre dos valores de verdad. Si ambos son verdaderos sera verdadero, caso controrio lo demas sera falso."
      ]
    },
    {
      "pregunta": "disyuncion",
      "respuesta": [
        "La disyunción es un operador lógico que actúa sobre dos valores de verdad, típicamente los valores de verdad de dos proposiciones devolviendo el valor de verdad, solo si ambos son falsos el resultado sera falso."
      ]
    },
    {
      "pregunta": "HOLA",
      "respuesta": [
        "como estas"
      ]
    },
    {
      "pregunta": "quien eres tu?",
      "respuesta": [
        "Soy un ChatBot que te ayuda con tus dudas sobre la logica proposicional. Mis funciones son desarrolar tablas de verdad y consultor de conceptos sobre logica proposicional, conectores Logicos y mas."
      ]
    },
    {
      "pregunta": "que es disyuncion?",
      "respuesta": [
        "La disyuncion es un operador que actua sobre dos valores de verdad, tipicamente los valores de verdad, solo si ambos son falsos el resultado sera falso"
      ]
    },
    {
      "pregunta": "que es bicondicional?",
      "respuesta": [
        "Es aquel conectivo logico que cumple cuando p y q son iguales el resultado sera verdadero y lo demas sera falso"
      ]
    },
    {
      "pregunta": "conjuncion",
      "respuesta": [
        "La conjuncion es un operador, que actua sobre dos valores de verdad. Si ambos son verdaderos sera verdadero, caso contrario lo demas sera falso"
      ]
    },
    {
      "pregunta": "bien y tu",
      "respuesta": [
        "Estoy bien gracias por preguntar :)"
      ]
    },
    {
      "pregunta": "disyuncion excluyente",
      "respuesta": [
        "Es aquel conectivo logico que se cumple cuando p y q son iguales, en ese caso su resultado es falso y lo demas verdadero"
      ]
    },
    {
      "pregunta": "tautologia",
      "respuesta": [
        "Proposicion compuesta que en la tabla de verdad resulta verdadera en todos los casos"
      ]
    },
    {
      "pregunta": "que es tautologia",
      "respuesta": [
        "Proposicion compuesta que en la tabla de verdad resulta verdadera en todos los casos"
      ]
    },
    {
      "pregunta": "condicional",
      "respuesta": [
        "El condicional es un operador que actua sobre los dos valores de verdad, en la que si p es verdadero y q es falso su resultado sera falso y los demas verdadero"
      ]
    },
    {
      "pregunta": "contradiccion",
      "respuesta": [
        "Proposicion compuesta que en la tabla de verdad resulta falso en todos los casos"
      ]
    },
    {
      "pregunta": "contingencia",
      "respuesta": [
        "Proposicion compuesta que en la tabla de verdad resulta verdadero y falso en todos los casos"
      ]
    },
    {
      "pregunta": "quiero que me ayudes a desarrollar una tabla de verdad",
      "respuesta": [
        "Esta bien. Para que te ayude a desarrollar las tablas de verdad ingresa \"desarrollo tabla\""
      ]
    },
    {
      "pregunta": "quiero salir del chatbot",
      "respuesta": [
        "Esta bien. Para salir escribe \"salir\""
      ]
    }
  ]
}